package com.aleksandrp.schoolbooksleeveel1.db.constants;

/**
 * Created by Aleksandr on 25.09.2015.
 */
public interface ValuesDB {


    String TAG_DB = "My_Db";

    String NAME_DB = "schools_books";

    int VERSION_DB = 1;
    String TABLE_BOOK = "table_book";

    String TABLE_ITEM = "table_item";
    String COLUMN_ID = "_id";
    String COLUMN_NAME_ITEM = "name_item";

    String COLUMN_LEVEL_ITEM = "level_item";
    String COLUMN_ICON_ADDRESS = "icon_address";
    String COLUMN_NAME_BOOK = "name_book";
    String COLUMN_AUTHOR = "author";
    String COLUMN_ID_ITEM = "id_item";

    String COLUMN_LEVEL_BOOK = "level_book";

    String CREATE_TABLE_BOOK = "CREATE TABLE IF NOT EXISTS " +
            TABLE_BOOK + " (" + COLUMN_ICON_ADDRESS + " TEXT DEFAULT (' '), " +
            COLUMN_NAME_BOOK + " TEXT NOT NULL, " +
            COLUMN_AUTHOR + " TEXT NOT NULL, " +
            COLUMN_ID_ITEM + " INTEGER NOT NULL, " +
            COLUMN_LEVEL_BOOK + " INTEGER NOT NULL);";

    String CREATE_TABLE_ITEM = "CREATE TABLE IF NOT EXISTS " +
            TABLE_ITEM + " (" + COLUMN_NAME_ITEM + " TEXT NOT NULL, " +
            COLUMN_ID + " INTEGER NOT NULL PRIMARY KEY AUTOINCREMENT UNIQUE, " +
            COLUMN_LEVEL_ITEM + " INTEGER NOT NULL);";

    String INSERT_ITEMS = "INSERT INTO "+ TABLE_ITEM + "(name_item, level_item) VALUES\n" +
            "('Французкий язык          ', 1),\n" +
            "('Украинский язык          ', 1),\n" +
            "('Трудовое обучение        ', 1),\n" +
            "('Русский язык             ', 1),\n" +
            "('Природоведение           ', 1),\n" +
            "('Основы здоровья          ', 1),\n" +
            "('Изобразительное исскуство', 1),\n" +
            "('Немецкий язык            ', 1),\n" +
            "('Музыка                   ', 1),\n" +
            "('Математика               ', 1),\n" +
            "('Букварь                  ', 1),\n" +
            "('Английский язык          ', 1),\n" +
            "('Французкий язык           ', 2),\n" +
            "('Украинский язык           ', 2),\n" +
            "('Трудовое обучение         ', 2),\n" +
            "('Основы информатики        ', 2),\n" +
            "('Русский язык              ', 2),\n" +
            "('Природоведение            ', 2),\n" +
            "('Основы здоровья           ', 2),\n" +
            " ('Немецкий язык            ', 2),\n" +
            " ('Музыка                   ', 2),\n" +
            "('Исскуство                 ', 2),\n" +
            "('Математика                ', 2),\n" +
            " ('Литературное чтение      ', 2),\n" +
            "('Английский язык           ', 2),\n" +
            "('Я и Украина          ', 3),\n" +
            "('Французкий язык      ', 3),\n" +
            "('Украинский язык      ', 3),\n" +
            "('Трудовое обучение    ', 3),\n" +
            "('Основы информатики   ', 3),\n" +
            "('Русский язык         ', 3),\n" +
            "('Природоведение       ', 3),\n" +
            "('Основы здоровья      ', 3),\n" +
            "('Немецкий язык        ', 3),\n" +
            "('Музыка               ', 3),\n" +
            "('Исскуство            ', 3),\n" +
            "('Математика           ', 3),\n" +
            "('Литературное чтение  ', 3),\n" +
            "('Английский язык      ', 3),\n" +
            "('Я и Украина       ', 4),\n" +
            "('Читанка           ', 4),\n" +
            "('Украинский язык   ', 4),\n" +
            "('Русский язык      ', 4),\n" +
            "('Природоведение    ', 4),\n" +
            "('Основы здоровья   ', 4),\n" +
            " ('Музыка           ', 4),\n" +
            "('Математика        ', 4),\n" +
            " ('Информатика      ', 4),\n" +
            "('Английский язык    ', 4),\n" +
            "('Французкий язык             ', 5),\n" +
            "('Украинский язык             ', 5),\n" +
            "('Украинская литература       ', 5),\n" +
            "('Трудовое обучение           ', 5),\n" +
            "('Русский язык                ', 5),\n" +
            "('Природоведение              ', 5),\n" +
            "('Основы христианской этики   ', 5),\n" +
            "('Основы здоровья             ', 5),\n" +
            "('Образовательное исскуство   ', 5),\n" +
            "('Немецкий язык               ', 5),\n" +
            "('Музыка                      ', 5),\n" +
            "('Исскуство                   ', 5),\n" +
            "('Математика                  ', 5),\n" +
            "('Русская литературв          ', 5),\n" +
            "('История Украины             ', 5),\n" +
            "('Информатика                 ', 5),\n" +
            "('Зарубежная литература       ', 5),\n" +
            " ('Этика                      ', 5),\n" +
            " ('Английский язык            ', 5),\n" +
            " ('Музыка                             ', 6),\n" +
            "('Математика                         ', 6),\n" +
            "('Русская литературв                 ', 6),\n" +
            "('Информатика                        ', 6),\n" +
            " ('Зарубежная литература             ', 6),\n" +
            " ('Этика                             ', 6),\n" +
            " ('География                         ', 6),\n" +
            " ('Всемирная историяб История Украины', 6),\n" +
            " ('Биология                          ', 6),\n" +
            " ('Английский язык                   ', 6),\n" +
            " ('Трудовое обучение                 ', 6),\n" +
            " ('Русский язык                      ', 6),\n" +
            " ('Природоведение                    ', 6),\n" +
            " ('Польский язык                     ', 6),\n" +
            " ('Основы здоровья                   ', 6),\n" +
            " ('Образовательное исскуство         ', 6),\n" +
            " ('Немецкий язык                     ', 6),\n" +
            "('Украинский язык                   ', 6),\n" +
            "('Украинская литература            ', 6),\n" +
            "('Русский язык и литература ',  7),\n" +
            "('История Украины           ',  7),\n" +
            "('История средних веков     ',  7),\n" +
            "('Информатика               ',  7),\n" +
            "('Зарубежная литература     ',  7),\n" +
            "('Геометрия                 ',  7),\n" +
            "('География                 ',  7),\n" +
            "('Биология                  ',  7),\n" +
            "('Английский язык           ',  7),\n" +
            "('Алгебра                   ',  7),\n" +
            "('Химия                     ',  7),\n" +
            "('Французкий язык           ',  7),\n" +
            "('Физика                    ',  7),\n" +
            "('Украинская литература     ',  7),\n" +
            "('Русский язык              ',  7),\n" +
            "('Родной язык               ',  7),\n" +
            "('Основы здоровья           ',  7),\n" +
            "('Немецкий язык             ',  7),\n" +
            "('Музыка                    ',  7),\n" +
            "('Музыкальное исскуство       ', 8),\n" +
            "('Русская литература          ', 8),\n" +
            "('Черчение 8-9                ', 8),\n" +
            "('История Украины             ', 8),\n" +
            "('Зарубежная литература       ', 8),\n" +
            "('Геометрия                   ', 8),\n" +
            "('Всемирная история           ', 8),\n" +
            "('Биология                    ', 8),\n" +
            "('Английский язык             ', 8),\n" +
            "('Алгебра                     ', 8),\n" +
            "('Химия                       ', 8),\n" +
            "('Французкий язык             ', 8),\n" +
            "('Физическая география Украины', 8),\n" +
            "('Физика                      ', 8),\n" +
            "('Украинский язык             ', 8),\n" +
            "('Украинская литература       ', 8),\n" +
            "('Трудовое обучение           ', 8),\n" +
            "('Русский язык                ', 8),\n" +
            "('Основы здоровья             ', 8),\n" +
            "('Немецкий язык               ', 8),\n" +
            "('Черчение 8-9             ', 9),\n" +
            "('История Украины          ', 9),\n" +
            "('Информатика              ', 9),\n" +
            "('Зарубежная литература    ', 9),\n" +
            "('Геометрия                ', 9),\n" +
            "('География                ', 9),\n" +
            "('Всемирная история        ', 9),\n" +
            "('Биология                 ', 9),\n" +
            "('Английский язык          ', 9),\n" +
            "('Алгебра                  ', 9),\n" +
            "('Художественная культура  ', 9),\n" +
            "('Химия                    ', 9),\n" +
            "('Физическая культура      ', 9),\n" +
            "('Физика                   ', 9),\n" +
            "('Украинская литература    ', 9),\n" +
            "('Трудовое обучение        ', 9),\n" +
            "('Русский язык             ', 9),\n" +
            "('Правознавство            ', 9),\n" +
            "('Основы здоровья          ', 9),\n" +
            "('Немецкий язык            ', 9),\n" +
            "('Русский язык и литература', 9),\n" +
            "('Русский язык и литература', 10),\n" +
            "('История Украины          ', 10),\n" +
            "('Защита Отечества         ', 10),\n" +
            "('Экономика                ', 10),\n" +
            "('Экология                 ', 10),\n" +
            "('Геометрия                ', 10),\n" +
            "('География                ', 10),\n" +
            "('Всемирная история        ', 10),\n" +
            "('Биология                 ', 10),\n" +
            "('Английский язык          ', 10),\n" +
            "('Алгебра                  ', 10),\n" +
            "('Информатика              ', 10),\n" +
            "('Художественная культура  ', 10),\n" +
            "('Химия                    ', 10),\n" +
            "('Французкий язык          ', 10),\n" +
            "('Философия                ', 10),\n" +
            "('Физика                   ', 10),\n" +
            "('Украинский язык          ', 10),\n" +
            "('Украинская литература    ', 10),\n" +
            "('Технологии               ', 10),\n" +
            "('Мировая литература       ', 10),\n" +
            "('Русский язык             ', 10),\n" +
            "('Правознавство            ', 10),\n" +
            "('Немецкий язык            ', 10),\n" +
            "('Математика               ', 10),\n" +
            "('Черчение                  ', 11),\n" +
            "('История Украины           ', 11),\n" +
            "('Информатика               ', 11),\n" +
            "('Защита Отечества          ', 11),\n" +
            "('Экономика                 ', 11),\n" +
            "('Экология                  ', 11),\n" +
            "('Геометрия                 ', 11),\n" +
            "('Всемирная история         ', 11),\n" +
            "('Биология                  ', 11),\n" +
            "('Астрономия                ', 11),\n" +
            "('Английский язык           ', 11),\n" +
            "('Алгебра                   ', 11),\n" +
            "('Художественная культура   ', 11),\n" +
            "('Химия                     ', 11),\n" +
            "('Французкий язык           ', 11),\n" +
            "('Физика                    ', 11),\n" +
            "('Украинский язык           ', 11),\n" +
            "('Украинская литература     ', 11),\n" +
            "('Технологии                ', 11),\n" +
            "('Мировая литература        ', 11),\n" +
            "('Русский язык              ', 11),\n" +
            "('Немецкий язык             ', 11),\n" +
            "('Математика                ', 11),\n" +
            "('Человек и мир             ', 11),\n" +
            "('Русский язык и литература ', 11);\n";
}
